# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [8]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
first_data_set = pd.Series(np.random.randint(1,5,100))
second_data_set = pd.Series(np.random.randint(1,4,100))
third_data_set = pd.Series(np.random.randint(10000,30000,100))

In [10]:
first_data_set

0     2
1     1
2     2
3     4
4     1
     ..
95    3
96    3
97    3
98    2
99    2
Length: 100, dtype: int32

In [11]:
second_data_set

0     3
1     2
2     1
3     1
4     1
     ..
95    3
96    2
97    1
98    1
99    3
Length: 100, dtype: int32

In [12]:
third_data_set

0     24030
1     13605
2     16123
3     20496
4     23161
      ...
95    16797
96    18542
97    21034
98    13534
99    29261
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
df = pd.DataFrame(pd.concat([first_data_set,second_data_set,third_data_set],axis=1))
df

    0  1      2
0   2  3  24030
1   1  2  13605
2   2  1  16123
3   4  1  20496
4   1  1  23161
.. .. ..    ...
95  3  3  16797
96  3  2  18542
97  3  1  21034
98  2  1  13534
99  2  3  29261

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [14]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            24030
1      1       2            13605
2      2       1            16123
3      4       1            20496
4      1       1            23161

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [21]:
bigcolumn = pd.concat([first_data_set,second_data_set,third_data_set])
bigcolumn

0         2
1         1
2         2
3         4
4         1
      ...
95    16797
96    18542
97    21034
98    13534
99    29261
Length: 300, dtype: int32

In [16]:
bigcolumn.to_frame()

        0
0       2
1       1
2       2
3       4
4       1
..    ...
95  16797
96  18542
97  21034
98  13534
99  29261

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [17]:
len(bigcolumn) # then will go after 99 and dont stop

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [18]:
bigcolumn.reset_index(drop=True).reindex(range(300))

0          2
1          1
2          2
3          4
4          1
       ...
295    16797
296    18542
297    21034
298    13534
299    29261
Length: 300, dtype: int32